app/Http/Controllers/WecolmeController.php

select * from `products`
---
    public function cart()
    {
        $result= DB::table('products')->get();